app/controllers/carts_controller.rb

  def show
     @my_cart = Cart.find(params[:id])
---
SELECT  "carts".* FROM "carts"  WHERE "carts"."id" = ? LIMIT 1  [["id", 9]]