app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-02-26 09:51:51.064561"], ["updated_at", "2015-02-26 09:51:51.064561"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", "2015-02-26 14:28:08.116809"], ["product_id", 1], ["updated_at", "2015-02-26 14:28:08.116809"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id, product.price)
    session[:counter] = 0
    respond_to do |format|
      if @line_item.save

SELECT  "line_items".* FROM "line_items"  WHERE "line_items"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 11]]
---
   def destroy
     @line_item=LineItem.find(params[:id])
     if @line_item.quantity > 1
       @line_item.quantity -= 1
       @line_item.save
     else
       @line_item.destroy