app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("created_at", "description", "img_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-02-20 07:12:22.593863"], ["description", "MyText"], ["img_url", "MyString"], ["price", 9.99], ["title", "MyString"], ["updated_at", "2015-02-20 07:12:22.593863"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "img_url" = ?, "title" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["img_url", "mango16.jpg"], ["title", "mango12"], ["updated_at", "2015-02-27 08:48:20.524195"]]